/*===========================================================================================
概　要:ブロックとなる基本の設定
作成日:2015.10.26
更新日:2015.11.11
制作者:藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "Global.h"
#include "UnitBase.h"
#include "Effect2D.h"

//現在のスクロールの位置(PlayScene.cppで宣言済み)
extern D3DXVECTOR3 g_stageScrollPosition;

class Block : public UnitBase
{
	Sprite Wall;
	int Number;
	int blPoint;

public:
	Block();
	~Block();

	//----------------------------------
	//機能：画像・音楽データの読み込み
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Load(char* filename);

	//----------------------------------
	//機能：更新処理
	//引数：なし
	//戻値：成功
	//----------------------------------
	HRESULT Update();

	//----------------------------------
	//機能：当たり判定
	//引数：pTarget		敵の情報
	//戻値：成功
	//----------------------------------
	HRESULT Hit(UnitBase* pTarget);

	//----------------------------------
	//機能：描画処理
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Render();

	//----------------------------------
	//機能：外部から呼ぶ描画処理
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Drow(D3DXVECTOR3 pos, int table);

	void SetPosX(D3DXVECTOR3 pos){ position.x = pos.x; }
	
};