/*===========================================================================================
概　要:剣で攻撃するクラス
作成日:2016.02.24
更新日:2016.02.24
制作者:藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "Global.h"
#include "Enemy.h"
#include "Effect2D.h"

//現在のスクロールの位置(PlayScene.cppで宣言済み)
extern D3DXVECTOR3 g_stageScrollPosition;

//--------------バレットクラスの定義----------------
class Bread
{
protected:
	Sprite *spt;
	Effect2D *fvx;
	//位置
	D3DXVECTOR3 position;
	D3DXVECTOR3 enemyPosition = { NULL, NULL, NULL };

	//弾の状態　（未発射かどうか）
	BOOL isbread;

	int breadlife;			//弾だけに偶にフラグが消えないので意図的に消すための変数
	int breadDamage = 4;	//ブレードのダメージ量(エネミーにHP実装時に活躍)

	int dirflg = NULL;
	//--------------プレイヤーの向き------------------
	enum MOVE_SCENE
	{
		MS_DOWN,
		MS_LEFT,
		MS_RIGHT,
		MS_UP,
	};
	//------------------------------------------------

public:
	Bread();
	~Bread();

	//----------------------------------
	//機能：画像・音楽データの読み込み
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Load();

	//----------------------------------
	//機能：更新処理
	//引数：なし
	//戻値：成功
	//----------------------------------
	HRESULT Update(D3DXVECTOR3 playerPos);
	
	//----------------------------------
	//機能：当たり判定
	//引数：pTarget		敵の情報
	//戻値：成功
	//----------------------------------
	BOOL Hit(UnitBase* pTarget);	

	//----------------------------------
	//機能：描画処理
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Render();

	//弾の発射処理
	BOOL bread(D3DXVECTOR3 playerPos, int dir);

	void Reset();
};