/*===========================================================================================
概　略：カメラ（視点）の設定
作成日：2015.08.25
更新日：2015.08.28
制作者：藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "Global.h"

//--------------カメラクラスの定義------------------
class Camera
{
	D3DXVECTOR3     pos;     //カメラの位置
	D3DXVECTOR3		target;  //焦点位置
	D3DXVECTOR3     upVec;   //上方向

	float angle;			 //画角
	float aspect;			 //アスペクト比
	float nearClip;			 //近クリッピング
	float farClip;			 //遠クリッピング

	D3DXMATRIX   view;		 //ビュー行列
	D3DXMATRIX   proj;		 //射影行列

	//----------------------------------------
	//機能：ビュー行列（カメラの位置や向き）を作る
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------------
	HRESULT SetView();

	//----------------------------------------
	//機能：射影行列
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------------
	HRESULT SetProjection();


public:
	Camera();
	~Camera();

	//----------------------------------------
	//機能：SetViewとSetProjectionを呼ぶ
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------------
	HRESULT Update();

	//----------アクセス関数(カメラ)----------
	void SetPos(D3DXVECTOR3 v){ pos = v; }			//カメラのポジションを渡す
	void SetTarget(D3DXVECTOR3 v){ target = v; }	//カメラの焦点位置を渡す
	void SetUp(D3DXVECTOR3 v){ upVec = v; }			//カメラのベクトルを渡す

	//---------アクセス関数(射影行列)---------
	void SetAngle(float f){ angle = f; }			//画各（ラジアン）
	void SetAspect(float f){ aspect = f; }			//アスペクト比
	void SetNearClip(float f){ nearClip = f; }		//近クリッピング
	void SetFarClip(float f){ farClip = f; }		//遠クリッピング
};

//パーステクティブという言葉がある、これは遠近感を表す言葉である。
//Unityでも使われる言葉なので、後でしっかりつづりを覚えること。
