/*===========================================================================================
概　要:クリア画面
作成日:2016.02.08
更新日:2016.02.08
制作者:藤原順基
===========================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "UnitBase.h"

class Clear : public UnitBase
{
	Sprite back;

	int i = 60;

	bool loop = true;

public:
	Clear();
	~Clear();
	HRESULT Load();
	HRESULT Update();
	HRESULT Render();
};

