/*===========================================================================================
概　略：エフェクトをアニメーションさせて表示する
作成日：2015.08.24
更新日：2015.08.24
制作者：藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "Sprite.h"

//----------2Dエフェクトクラスの定義----------------
class Effect2D
{
	Sprite *spt;			//スプライトクラスのポインタ宣言
	float speed;			//モーションの速度
	D3DXVECTOR2 size;		//画像の大きさ

	//エフェクトは複数存在する場合が多い、それに対応できるようにする
	struct EffectData
	{
		float anm;				//アニメーションの基点
		D3DXVECTOR3 position;
	};

	//ヴェクターを使えば配列として増やすことができ、数を調整できる。
	std::list<EffectData> effectData;


public:

	Effect2D();						//コンストラクタ
	~Effect2D();					//デストラクタ
	HRESULT Load(char* fileName, D3DXVECTOR2 ptcSize, float spd);	//エフェクト画像を読み込む
	void Draw();					//エフェクトの表示
	void Add(D3DXVECTOR3 pos);		//エフェクトを表示させる位置が引数
};


