/*===========================================================================================
概　要:ゲームオーバー画面
作成日:2016.01.19
更新日:2016.01.19
制作者:藤原順基
===========================================================================================*/

#include "GameOver.h"

//----------------------------------
//機能：コンストラクタ
//引数：なし
//戻値：なし
//----------------------------------
GameOver::GameOver()
{
}

//----------------------------------
//機能：デストラクタ
//引数：なし
//戻値：なし
//----------------------------------
GameOver::~GameOver()
{
}

//----------------------------------
//機能：ゲームオーバー画像とSEの読み込み処理
//引数：なし
//戻値：成功or失敗
//----------------------------------
HRESULT GameOver::Load()
{
	if (FAILED(spt.Load("pictures\\太郎.jpg")))
	{
		return E_FAIL;
	}
	return S_OK;
}

//----------------------------------
//機能：更新処理
//引数：なし
//戻値：成功
//----------------------------------
HRESULT GameOver::Update()
{
	//スペースキー及びコントローラーのAを押すとプレイシーンへ移行する
	if (g_pInput->IsKeyTap(DIK_ESCAPE) /*|| g_pInput->IsPadButtonPush(XINPUT_GAMEPAD_A)*/)
	{
		g_gameScene = SC_TITLE;
	}

	if (g_pInput->IsKeyTap(DIK_SPACE))
	{
		g_gameScene = SC_PLAY;
	}
	return S_OK;
}

//----------------------------------
//機能：描画処理
//引数：なし
//戻値：成功
//----------------------------------
HRESULT GameOver::Render()
{
	//背景なので特に弄らず画面いっぱいに表示させる
	SpriteData data;
	//色と透明度
	data.color.a = 255;
	data.color.r = 255;
	data.color.g = 255;
	data.color.b = 255;
	spt.Draw(&data);

	return S_OK;
}