/*===========================================================================================
概　要:ゲームオーバーシーン ~ゲームオーバーになったら終了(現時点)~
作成日:2016.01.19
更新日:2016.01.19
制作者:藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "SceneBase.h"

//------------ゲームオーバーシーン------------------
class GameOverScene : public SceneBase
{
public:
	//コンストラクタでゲームオーバーをpush_backする
	GameOverScene();
};

