/*===========================================================================================
概　略：ゲーム全体の流れを扱う処理
作成日：2015.05.29
更新日：2015.09.07
制作者：藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "Global.h"
#include "SceneBase.h"

//―――――――――――――――――――――
//	ゲームクラス
//―――――――――――――――――――――
class Game
{
	//LPうんたらかんたら、とついてる関数は"ポインタ"として扱われる。そのためのp
	//Direct3Dオブジェクト
	LPDIRECT3D9 pD3d;

	//シーンオブジェクト
	SceneBase* scene[SC_MAX];


public:
	//コンストラクタ
	Game();

	//デストラクタ
	~Game();

	//DirextX初期化
	HRESULT InitD3d(HWND);

	//読み込み処理
	HRESULT Load();
	
	//衝突判定処理
	HRESULT Hit();

	//更新処理
	HRESULT Update();

	//描画処理
	//引数：なし
	HRESULT Render();

	HRESULT Game::InitLight();
};

