/*===========================================================================================
概　要:回復アイテムや残機アップアイテム等
作成日:2016.01.26
更新日:2016.01.26
制作者:藤原順基
===========================================================================================*/

//---------------インクルード-----------------------
#include "item.h"

//----------------------------------
//機能：コンストラクタ
//引数：なし
//戻値：なし
//----------------------------------
item::item()
{
}

//----------------------------------
//機能：デストラクタ
//引数：なし
//戻値：なし
//----------------------------------
item::~item()
{
}

//----------------------------------
//機能：画像・音楽データの読み込み
//引数：なし
//戻値：成功or失敗
//----------------------------------
HRESULT item::Load(char *filename)
{
	if (FAILED(Recover_Aid.Load(filename)))
	{
		return E_FAIL;
	}

	return S_OK;
}

//----------------------------------
//機能：更新処理
//引数：なし
//戻値：成功
//----------------------------------
HRESULT item::Update()
{
	return S_OK;
}

//----------------------------------
//機能：当たり判定
//引数：pTarget		敵の情報
//戻値：成功
//----------------------------------
HRESULT item::Hit(UnitBase* pTarget)
{
	return S_OK;
}

//----------------------------------
//機能：描画処理
//引数：なし
//戻値：成功or失敗
//----------------------------------
HRESULT item::Render()
{
	return S_OK;
}

//----------------------------------
//機能：外部から呼ぶ描画処理
//引数：なし
//戻値：成功or失敗
//----------------------------------
HRESULT item::Drow(D3DXVECTOR3 pos)
{

	SpriteData Recover;

	//キャラの動きに合わせて画面が動くので、ステージの位置も変える
	Recover.pos.x = pos.x + g_stageScrollPosition.x;
	Recover.pos.y = pos.y + g_stageScrollPosition.y;

	Recover_Aid.Draw(&Recover);


	return S_OK;
}

//tst