/*===========================================================================================
概　略：描画関連の作成(カメラの向いてる向きのチェック等)
作成日：2015.08.31
更新日：2015.09.02
制作者：藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "Global.h"

//--------------ラインクラスの定義------------------
class Line
{
public:
	//----------------------------------
	//機能：描画処理(カラー無し)
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Draw(D3DXVECTOR3 start, D3DXVECTOR3 end);

	//----------------------------------
	//機能：描画処理(カラー付き)
	//引数：なし
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Draw(D3DXVECTOR3 start, D3DXVECTOR3 end, DWORD color);
};