/*===========================================================================================
概　略：プレイシーンを扱う処理
作成日：2015.05.29
更新日：2015.10.06
制作者：藤原順基
=============================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "SceneBase.h"
#include "Global.h"
#include <vector>

//------------プレイシーン------------------
class PlayScene : public SceneBase
{
public:
	//コンストラクタ
	PlayScene();

	HRESULT Create();
};
