/*=======================================================================================================
概　略：四角いポリゴンを作るための関数を作る
作成日：2015.09.01
更新日：2015.09.07
制作者：藤原順基
=======================================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "Global.h"

//--------------クアッドクラスの定義----------------
class Quad
{
	//テクスチャオブジェクト
	LPDIRECT3DTEXTURE9 pTexture;

public:
	Quad();
	~Quad();

	//----------------------------------
	//機能：三角形を二つ組み合わせて四角を作る
	//引数：ワールド座標
	//引数：テクスチャ座標
	//戻値：成功or失敗
	//----------------------------------
	HRESULT Draw(D3DXMATRIX* matWorld, D3DXMATRIX* matTex = NULL);

	HRESULT Load(char* fileName);
};