/*===========================================================================================
概　要:タイトル画面
作成日:2016.01.14
更新日:2016.01.19
制作者:藤原順基
===========================================================================================*/
#pragma once

//---------------インクルード-----------------------
#include "UnitBase.h"

//--------------タイトルクラスの定義----------------
class Title : public UnitBase
{
	Sprite back;
	Sprite manual;

	int i = 60;

	bool loop = true;
	
public:
	Title();
	~Title();
	HRESULT Load();
	HRESULT Update();
	HRESULT Render();
};
